Repository: ameedanxari/shamelagpt
Catalog: shamelagpt-ios/shamelagpt/Resources/*.lproj/Localizable.strings
Languages: ar, ur

# about.goal
source: ShamelaGPT was created to help close this gap by offering AI tools grounded in authentic sources, with transparency, traceability, and context at the core.
ar: جاءت شامِلة جي بي تي لتُسهم في سد هذه الفجوة عبر أدوات ذكاء اصطناعي مرتكزة على مصادر أصيلة مع شفافية وإحالة للمصادر وسياق.
ur: شاملہ جی پی ٹی اس خلا کو کم کرنے کے لیے بنایا گیا ہے، مستند مصادر پر مبنی AI ٹولز کے ذریعے جن کی بنیاد شفافیت، سراغ رسانی اور سیاق ہو۔

# about.dataSourceTitle
source: Data Source
ar: مصدر البيانات
ur: ڈیٹا کا ماخذ

# about.dataSource
source: All responses are generated using the comprehensive library of Shamela.ws, one of the most trusted and extensive digital Islamic libraries available today.
ar: جميع الإجابات مستمدة من المكتبة الشاملة من موقع Shamela.ws، وهي واحدة من أكثر المكتبات الإسلامية الرقمية الموثوقة والشاملة المتاحة اليوم.
ur: تمام جوابات Shamela.ws کی جامع لائبریری سے تیار ہوتے ہیں، جو آج دستیاب معتبر اور وسیع ترین اسلامی ڈیجیٹل لائبریریوں میں سے ایک ہے۔

# about.dataHandlingTitle
source: How we handle your data
ar: كيفية تعاملنا مع بياناتك
ur: ہم آپ کے ڈیٹا کو کیسے سنبھالتے ہیں

# about.dataHandling
source: Messages, voice input, and images you choose for OCR are sent securely to our servers to generate answers. Conversations are stored locally and can be deleted from History; you can delete your account (and server-side data) in Settings.
ar: يتم إرسال الرسائل والإدخال الصوتي والصور التي تختارها لـ OCR بشكل آمن إلى خوادمنا لتوليد الإجابات. يتم تخزين المحادثات محلياً ويمكن حذفها من السجل؛ ويمكنك حذف حسابك (وبيانات الخادم) من الإعدادات.
ur: پیغامات، آواز کا اندراج، اور وہ تصاویر جو آپ OCR کے لیے منتخب کرتے ہیں، محفوظ طریقے سے ہمارے سرورز کو بھیجی جاتی ہیں تاکہ جوابات تیار کیے جا سکیں۔ گفتگوئیں مقامی طور پر محفوظ ہوتی ہیں اور تاریخچہ سے حذف کی جا سکتی ہیں؛ آپ اپنا اکاؤنٹ (اور سرور کا ڈیٹا) ترتیبات سے حذف کر سکتے ہیں۔

# about.companyTitle
source: Who built ShamelaGPT?
ar: من يقف وراء شاملة جي بي تي؟
ur: شاملہ جی پی ٹی کس نے بنایا؟

# about.companyDescription
source: ShamelaGPT is built and maintained by Neural Lines, a team focused on responsible AI products grounded in authentic sources.
ar: شاملة جي بي تي يتم تطويره وصيانته بواسطة Neural Lines، فريق يركز على منتجات ذكاء اصطناعي مسؤولة مبنية على مصادر أصيلة.
ur: شاملہ جی پی ٹی کو Neural Lines نے تیار اور برقرار رکھا ہے—ایک ٹیم جو مستند ذرائع پر مبنی ذمہ دار AI مصنوعات پر توجہ رکھتی ہے۔

# about.companyLink
source: Visit Neural Lines
ar: زيارة Neural Lines
ur: Neural Lines ملاحظہ کریں

# accessibility.logo
source: ShamelaGPT Logo
ar: شعار شاملة جي بي تي
ur: شاملہ جی پی ٹی کا لوگو

# accessibility.getStartedHint
source: Dismisses the welcome screen and starts using ShamelaGPT
ar: إغلاق شاشة الترحيب والبدء في استخدام شاملة جي بي تي
ur: ویلکم اسکرین بند کر کے شاملہ جی پی ٹی استعمال کرنا شروع کریں

# accessibility.skipToChatHint
source: Skips the welcome screen and goes directly to chat
ar: تخطي شاشة الترحيب والذهاب مباشرة إلى المحادثة
ur: ویلکم اسکرین چھوڑ کر براہ راست گفتگو پر جائیں

# accessibility.chatTabHint
source: Chat with ShamelaGPT assistant
ar: المحادثة مع مساعد شاملة جي بي تي
ur: شاملہ جی پی ٹی معاون کے ساتھ گفتگو

# accessibility.historyTabHint
source: View your conversation history
ar: عرض سجل المحادثات
ur: اپنی گفتگو کا تاریخچہ دیکھیں

# accessibility.settingsTabHint
source: Adjust app settings and preferences
ar: ضبط إعدادات التطبيق والتفضيلات
ur: ایپ کی ترتیبات اور ترجیحات ترتیب دیں

# accessibility.sendMessageHint
source: Sends your message to ShamelaGPT
ar: إرسال رسالتك إلى شاملة جي بي تي
ur: آپ کا پیغام شاملہ جی پی ٹی کو بھیجتا ہے

# accessibility.camera
source: Camera
ar: الكاميرا
ur: کیمرہ

# accessibility.cameraHint
source: Takes a photo or selects an image to extract text
ar: التقاط صورة أو تحديد صورة لاستخراج النص
ur: متن نکالنے کے لیے تصویر کھینچیں یا منتخب کریں

# accessibility.microphoneStart
source: Start voice input
ar: بدء الإدخال الصوتي
ur: آواز کا اندراج شروع کریں

# accessibility.microphoneStop
source: Stop recording
ar: إيقاف التسجيل
ur: ریکارڈنگ روکیں

# accessibility.microphoneStartHint
source: Tap to start recording voice input
ar: اضغط لبدء تسجيل الإدخال الصوتي
ur: آواز کا اندراج شروع کرنے کے لیے تھپتھپائیں

# accessibility.microphoneStopHint
source: Tap to stop recording and transcribe your speech
ar: اضغط لإيقاف التسجيل وتحويل كلامك إلى نص
ur: ریکارڈنگ روک کر آپ کی آواز کو متن میں بدلیں

# accessibility.microphoneRecordingValue
source: Recording
ar: جاري التسجيل
ur: ریکارڈنگ ہو رہی ہے

# accessibility.microphoneNotRecordingValue
source: Not recording
ar: غير مسجل
ur: ریکارڈنگ نہیں

# accessibility.openSettingsHint
source: Opens the Settings app to enable %@ permission
ar: فتح تطبيق الإعدادات لتمكين إذن %@
ur: اس فیچر کے لیے %@ کی اجازت دینے کو سیٹنگز کھولیں

# accessibility.tryAgainHint
source: Retries the failed operation
ar: إعادة محاولة العملية الفاشلة
ur: ناکام عمل کو دوبارہ آزمائیں

# permission.message
source: ShamelaGPT needs %@ permission to use this feature. You can enable it in Settings.
ar: يحتاج شاملة جي بي تي إلى إذن %@ لاستخدام هذه الميزة. يمكنك تمكينها في الإعدادات.
ur: شاملہ جی پی ٹی کو اس فیچر کے استعمال کے لیے %@ کی اجازت درکار ہے۔ آپ اسے سیٹنگز میں فعال کر سکتے ہیں۔

# common.deleteAll
source: Delete All
ar: حذف الكل
ur: سب حذف کریں

# imagePicker.addImage
source: Add Image
ar: إضافة صورة
ur: تصویر شامل کریں

# imagePicker.takePhoto
source: Take Photo
ar: التقاط صورة
ur: تصویر کھینچیں

# imagePicker.chooseFromLibrary
source: Choose from Library
ar: اختيار من المكتبة
ur: لائبریری سے منتخب کریں

# auth.signIn
source: Sign In
ar: تسجيل الدخول
ur: سائن اِن

# auth.signUp
source: Sign Up
ar: إنشاء حساب
ur: اکاؤنٹ بنائیں

# auth.createAccount
source: Create Account
ar: إنشاء حساب
ur: اکاؤنٹ بنائیں

# auth.email
source: Email
ar: البريد الإلكتروني
ur: ای میل

# auth.password
source: Password
ar: كلمة المرور
ur: پاس ورڈ

# auth.displayName
source: Display name (optional)
ar: الاسم المعروض (اختياري)
ur: ظاہر ہونے والا نام (اختیاری)

# auth.continueAsGuest
source: Continue as guest
ar: المتابعة كضيف
ur: بطور مہمان جاری رکھیں

# auth.needAccount
source: Need an account? Sign up
ar: ليس لديك حساب؟ إنشاء حساب
ur: اکاؤنٹ نہیں ہے؟ نیا بنائیں

# auth.haveAccount
source: Have an account? Sign in
ar: لديك حساب؟ تسجيل الدخول
ur: اکاؤنٹ ہے؟ سائن اِن کریں

# auth.signInButton
source: Sign In
ar: تسجيل الدخول
ur: سائن اِن

# settings.pref.length.title
source: Response length
ar: طول الإجابة
ur: جواب کی لمبائی

# settings.pref.length.short
source: Short
ar: قصيرة
ur: مختصر

# settings.pref.length.medium
source: Medium
ar: متوسطة
ur: درمیانہ

# settings.pref.length.detailed
source: Detailed
ar: مفصلة
ur: تفصیلی

# settings.pref.style.title
source: Response style
ar: أسلوب الإجابة
ur: جواب کا انداز

# settings.pref.style.conversational
source: Conversational
ar: محادثي
ur: مکالماتی

# settings.pref.style.academic
source: Academic
ar: أكاديمي
ur: علمی

# settings.pref.style.technical
source: Technical
ar: تقني
ur: تکنیکی

# settings.pref.focus.title
source: Response focus
ar: تركيز الإجابة
ur: جواب کی توجہ

# settings.pref.focus.practical
source: Practical
ar: عملي
ur: عملی

# settings.pref.focus.theoretical
source: Theoretical
ar: نظري
ur: نظری

# settings.pref.focus.historical
source: Historical
ar: تاريخي
ur: تاریخی
