Repository: ameedanxari/shamelagpt
Catalog: shamelagpt-ios/shamelagpt/Resources/*.lproj/Localizable.strings
Languages: ar, ur

source: Chat
ar: المحادثة
ur: گفتگو

source: History
ar: السجل
ur: تاریخچہ

source: Settings
ar: الإعدادات
ur: ترتیبات

source: ShamelaGPT
ar: شاملة جي بي تي
ur: شاملہ جی پی ٹی

source: Back
ar: رجوع
ur: واپس

source: Done
ar: تم
ur: ہو گیا

# common.cancel
source: Cancel
ar: إلغاء
ur: منسوخ کریں

# chat.placeholder
source: Ask a question about Islam...
ar: اسأل سؤالاً عن الإسلام...
ur: اسلام کے بارے میں کوئی سوال پوچھیں...

# chat.send
source: Send message
ar: إرسال الرسالة
ur: پیغام بھیجیں

# chat.voiceInput
source: Voice input
ar: الإدخال الصوتي
ur: آواز کے ذریعے اندراج

# chat.imageTextRecognition
source: Image text recognition
ar: التعرف على النص من الصورة
ur: تصویر سے متن شناخت

# chat.recording
source: Recording...
ar: جاري التسجيل...
ur: ریکارڈنگ جاری ہے...

# chat.extractingText
source: Extracting text...
ar: جاري استخراج النص...
ur: متن نکالا جا رہا ہے...

# chat.thinking
source: Thinking...
ar: جاري التفكير...
ur: سوچا جا رہا ہے...

# chat.loadingMessages
source: Loading messages...
ar: جاري تحميل الرسائل...
ur: پیغامات لوڈ ہو رہے ہیں...

# chat.startConversation
source: Start a conversation
ar: ابدأ محادثة
ur: گفتگو شروع کریں

# chat.noMessagesYet
source: No messages yet
ar: لا توجد رسائل بعد
ur: ابھی تک کوئی پیغام نہیں

# chat.newConversation
source: New Conversation
ar: محادثة جديدة
ur: نئی گفتگو

# chat.newConversationWarningTitle
source: Start a new chat?
ar: بدء محادثة جديدة؟
ur: نئی گفتگو شروع کریں؟

# chat.newConversationWarningMessage
source: Starting a new chat will hide your current conversation. You won't be able to return to it.
ar: سيتم إخفاء محادثتك الحالية ولن تتمكن من العودة إليها.
ur: نئی گفتگو شروع کرنے سے آپ کی موجودہ گفتگو چھپ جائے گی اور آپ واپس نہیں جا سکیں گے۔

# chat.newConversationWarningMessageLoggedIn
source: Starting a new chat will hide your current conversation. You can open it again from History.
ar: سيتم إخفاء محادثتك الحالية، ويمكنك فتحها مرة أخرى من السجل.
ur: نئی گفتگو شروع کرنے سے آپ کی موجودہ گفتگو چھپ جائے گی، لیکن آپ اسے تاریخچہ سے دوبارہ کھول سکتے ہیں۔

# chat.newConversationWarningMessageLoggedOut
source: Starting a new chat will hide your current conversation. As a guest, you won't be able to return to it.
ar: سيتم إخفاء محادثتك الحالية، وبصفتك ضيفًا لن تتمكن من العودة إليها.
ur: نئی گفتگو شروع کرنے سے آپ کی موجودہ گفتگو چھپ جائے گی، اور بطور مہمان آپ اس پر واپس نہیں جا سکیں گے۔

# chat.viewHistory
source: View History
ar: عرض السجل
ur: تاریخچہ دیکھیں

# history.clearAll
source: Clear All
ar: مسح الكل
ur: سب صاف کریں

# history.newChat
source: New Chat
ar: محادثة جديدة
ur: نئی گفتگو

# history.noConversations
source: No Conversations
ar: لا توجد محادثات
ur: کوئی گفتگو نہیں

# history.startNewChatToBegin
source: Start a new chat to begin
ar: ابدأ محادثة جديدة للبدء
ur: آغاز کے لیے نئی گفتگو شروع کریں

# history.deleteConversation
source: Delete Conversation?
ar: حذف المحادثة؟
ur: گفتگو حذف کریں؟

# history.deleteConversationMessage
source: This action cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.
ur: یہ عمل واپس نہیں ہو سکتا۔

# history.deleteConversationMessageWithTitle
source: Are you sure you want to delete "%@"? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف "%@"؟ لا يمكن التراجع عن هذا الإجراء.
ur: کیا آپ واقعی "%@" کو حذف کرنا چاہتے ہیں؟ یہ عمل واپس نہیں ہو سکتا۔

# history.deleteAllConversations
source: Delete All Conversations?
ar: حذف جميع المحادثات؟
ur: تمام گفتگوئیں حذف کریں؟

# history.deleteAllConversationsMessage
source: This will delete all conversations permanently. This action cannot be undone.
ar: سيؤدي هذا إلى حذف جميع المحادثات بشكل دائم. لا يمكن التراجع عن هذا الإجراء.
ur: یہ تمام گفتگوئیں مستقل طور پر حذف کر دے گا۔ یہ عمل واپس نہیں ہو سکتا۔

# history.loadFailed
source: Failed to load conversations.
ar: تعذر تحميل المحادثات.
ur: مکالمات لوڈ نہیں ہو سکے۔

# history.deleteFailed
source: Failed to delete conversation.
ar: تعذر حذف المحادثة.
ur: مکالمہ حذف نہیں ہو سکا۔

# history.deleteAllFailed
source: Failed to delete all conversations.
ar: تعذر حذف جميع المحادثات.
ur: تمام مکالمات حذف نہیں ہو سکے۔

# history.loadingConversations
source: Loading conversations...
ar: جاري تحميل المحادثات...
ur: گفتگوئیں لوڈ ہو رہی ہیں...

# common.share
source: Share
ar: مشاركة
ur: شیئر کریں

# common.delete
source: Delete
ar: حذف
ur: حذف کریں

# history.localOnly
source: Local-only
ar: محلي فقط
ur: صرف مقامی

# settings.general
source: General
ar: عام
ur: عمومی

# settings.support
source: Support
ar: الدعم
ur: مدد

# settings.about
source: About
ar: حول
ur: متعلق

# settings.language
source: Language
ar: اللغة
ur: زبان

# language.english
source: English
ar: الإنجليزية
ur: انگریزی

# language.arabic
source: Arabic
ar: العربية
ur: عربی

# language.urdu
source: Urdu
ar: الأردية
ur: اردو

# language.current
source: English
ar: العربية
ur: اردو

# settings.aboutShamelaGPT
source: About ShamelaGPT
ar: حول شاملة جي بي تي
ur: شاملہ جی پی ٹی کے بارے میں

# settings.privacyPolicy
source: Privacy Policy
ar: سياسة الخصوصية
ur: رازداری کی پالیسی

# privacy.intro
source: Introduction
ar: المقدمة
ur: تعارف

# privacy.info
source: Information We Collect
ar: المعلومات التي نجمعها
ur: ہم کیا معلومات جمع کرتے ہیں

# privacy.usage
source: How We Use Your Information
ar: كيف نستخدم معلوماتك
ur: ہم آپ کی معلومات کیسے استعمال کرتے ہیں

# privacy.security
source: Data Security
ar: أمان البيانات
ur: ڈیٹا کا تحفظ

# privacy.rights
source: Your Rights
ar: حقوقك
ur: آپ کے حقوق

# privacy.contact
source: Contact Us
ar: تواصل معنا
ur: ہم سے رابطہ کریں

# settings.termsOfService
source: Terms of Service
ar: شروط الخدمة
ur: سروس کی شرائط

# terms.acceptance
source: Acceptance of Terms
ar: قبول الشروط
ur: شرائط کی منظوری

# terms.description
source: Description of Service
ar: وصف الخدمة
ur: سروس کی وضاحت

# terms.responsibilities
source: User Responsibilities
ar: مسؤوليات المستخدم
ur: صارف کی ذمہ داریاں

# terms.disclaimer
source: Disclaimer
ar: إخلاء المسؤولية
ur: اعلانِ لاتعلقی

# terms.ip
source: Intellectual Property
ar: الملكية الفكرية
ur: دانشورانہ ملکیت

# terms.liability
source: Limitation of Liability
ar: تحديد المسؤولية
ur: حدِ ذمہ داری

# terms.changes
source: Changes to Terms
ar: التغييرات على الشروط
ur: شرائط میں تبدیلیاں

# terms.contact
source: Contact Information
ar: معلومات الاتصال
ur: رابطے کی معلومات

# language.fontRestartNote
source: Note: After changing language, close the app from the task switcher and relaunch to apply font changes.
ar: ملاحظة: بعد تغيير اللغة، أغلق التطبيق من مبدل المهام وأعد تشغيله لتطبيق تغييرات الخط.
ur: نوٹ: زبان تبدیل کرنے کے بعد، ایپ کو ٹاسک سوئچر سے بند کر کے دوبارہ کھولیں تاکہ فونٹ تبدیلیاں لاگو ہوں۔

# settings.version
source: Version
ar: الإصدار
ur: ورژن

# settings.aiPreferences
source: AI Preferences
ar: تفضيلات الذكاء الاصطناعي
ur: اے آئی ترجیحات

# settings.aiPreferencesLockedTitle
source: Personalize Your Experience
ar: تخصيص تجربتك
ur: اپنا تجربہ ذاتی بنائیں

# settings.aiPreferencesLockedMessage
source: Sign in to customize AI responses with your preferred length, style, and focus.
ar: سجل الدخول لتخصيص ردود الذكاء الاصطناعي بالطول والأسلوب والتركيز المفضل لديك.
ur: اپنی پسند کی لمبائی، انداز، اور توجہ کے ساتھ AI جوابات کو حسبِ خواہش بنانے کے لیے سائن ان کریں۔

# settings.signInButton
source: Sign In
ar: تسجيل الدخول
ur: سائن اِن

# settings.refreshPreferences
source: Refresh Preferences
ar: تحديث التفضيلات
ur: ترجیحات تازہ کریں

# settings.signOut
source: Sign out
ar: تسجيل الخروج
ur: سائن آؤٹ

# settings.sendFeedback
source: Send Feedback
ar: إرسال ملاحظات
ur: فیڈبیک بھیجیں

# settings.deleteAccount
source: Delete Account
ar: حذف الحساب
ur: اکاؤنٹ حذف کریں

# settings.deleteAccountMessage
source: This will permanently delete your account and remove your conversations from the server. This action cannot be undone.
ar: سيتم حذف حسابك نهائياً وإزالة محادثاتك من الخادم. لا يمكن التراجع عن هذا الإجراء.
ur: اس سے آپ کا اکاؤنٹ مستقل طور پر حذف ہو جائے گا اور آپ کی گفتگوئیں سرور سے ہٹا دی جائیں گی۔ یہ عمل واپس نہیں ہو سکتا۔

# settings.deleteAccountError
source: Failed to delete account. Please try again.
ar: فشل حذف الحساب. يرجى المحاولة مرة أخرى.
ur: اکاؤنٹ حذف کرنے میں ناکام۔ دوبارہ کوشش کریں۔

# settings.preferencesLoadFailed
source: Failed to load preferences.
ar: تعذر تحميل التفضيلات.
ur: ترجیحات لوڈ نہیں ہو سکیں۔

# settings.preferencesSaveFailed
source: Failed to save preferences.
ar: تعذر حفظ التفضيلات.
ur: ترجیحات محفوظ نہیں ہو سکیں۔

# settings.deleteAccountServiceUnavailable
source: Service not available.
ar: الخدمة غير متاحة.
ur: سروس دستیاب نہیں ہے۔

# settings.customPrompt.title
source: Custom System Prompt
ar: موجه النظام المخصص
ur: حسبِ خواہش سسٹم پرامپٹ

# settings.customPrompt.placeholder
source: Tap to add a custom system prompt.
ar: اضغط لإضافة موجه نظام مخصص.
ur: اپنا کسٹم سسٹم پرامپٹ شامل کرنے کے لیے تھپتھپائیں۔

# settings.customPrompt.editTitle
source: Edit Prompt
ar: تعديل الموجه
ur: پرامپٹ میں ترمیم کریں

# settings.pref.current
source: Current
ar: القيمة الحالية
ur: موجودہ قدر

# feedback.promptTitle
source: Send Feedback
ar: إرسال ملاحظات
ur: فیڈبیک بھیجیں

# feedback.promptMessage
source: Would you like to send feedback to the team?
ar: هل ترغب في إرسال ملاحظات إلى الفريق؟
ur: کیا آپ ٹیم کو فیڈبیک بھیجنا چاہتے ہیں؟

# feedback.emailSubject
source: ShamelaGPT Feedback
ar: ملاحظات حول شاملة جي بي تي
ur: شاملہ جی پی ٹی فیڈبیک

# feedback.send
source: Send
ar: إرسال
ur: بھیجیں

# history.lockedTitle
source: Save Your Conversations
ar: احفظ محادثاتك
ur: اپنی گفتگوئیں محفوظ کریں

# history.lockedMessage
source: Sign in to keep track of your chat history, export conversations, and access them across devices.
ar: سجل الدخول للاحتفاظ بسجل محادثاتك، وتصديرها، والوصول إليها عبر الأجهزة.
ur: سائن ان کریں تاکہ اپنی گفتگوئیں محفوظ رکھ سکیں، برآمد کر سکیں، اور انہیں مختلف ڈیوائسز پر استعمال کر سکیں۔

# welcome.title
source: Welcome to ShamelaGPT
ar: مرحباً بك في شاملة جي بي تي
ur: شاملہ جی پی ٹی میں خوش آمدید

# welcome.intro
source: ShamelaGPT is built upon the vast and trusted library of Shamela.ws, bringing authentic Islamic knowledge closer to everyone. Our mission is to make reliable, reference-based information accessible in a natural and conversational way — across languages, backgrounds, and levels of understanding. Whether you seek deeper insight, quick clarifications, or evidence-backed answers to common misconceptions, ShamelaGPT helps you explore Islam's rich heritage with accuracy, respect, and ease. "Seek knowledge from the cradle to the grave." — Let this be your companion on that journey.
ar: تم بناء شاملة جي بي تي على المكتبة الشاملة الموثوقة من موقع Shamela.ws، لتقريب المعرفة الإسلامية الأصيلة للجميع. مهمتنا هي جعل المعلومات الموثوقة والمستندة إلى المراجع متاحة بطريقة طبيعية وحوارية — عبر اللغات والخلفيات ومستويات الفهم. سواء كنت تبحث عن رؤى أعمق، أو توضيحات سريعة، أو إجابات مدعومة بالأدلة على المفاهيم الخاطئة الشائعة، فإن شاملة جي بي تي يساعدك على استكشاف التراث الإسلامي الغني بدقة واحترام وسهولة. "اطلبوا العلم من المهد إلى اللحد." — لتكن هذه رفيقك في تلك الرحلة.
ur: شاملہ جی پی ٹی قابلِ اعتماد Shamela.ws لائبریری پر مبنی ہے، تاکہ مستند اسلامی علم سب کے قریب لایا جا سکے۔ ہمارا مقصد یہ ہے کہ مستند، حوالہ شدہ معلومات کو قدرتی اور مکالماتی انداز میں—زبانوں، پس منظر اور سمجھ کے مختلف درجات میں—دستیاب کیا جائے۔ چاہے آپ گہری بصیرت چاہتے ہوں، تیز وضاحتیں، یا عام غلط فہمیوں پر دلائل کے ساتھ جواب، شاملہ جی پی ٹی آپ کو اسلامی ورثہ احترام، دقت اور آسانی کے ساتھ دریافت کرنے میں مدد دیتا ہے۔ "گہوارے سے گور تک علم حاصل کرو"—یہ ایپ اس سفر میں آپ کی رفیق بنے۔

# welcome.signInTitle
source: Sign In for a Better Experience
ar: سجل الدخول لتجربة أفضل
ur: بہتر تجربے کے لیے سائن اِن کریں

# welcome.signInMessage
source: Log in to save your conversations, revisit your past questions, and share meaningful discussions with others. Creating an account also helps us improve your learning experience — personalizing insights, language preferences, and reference trails for you. Sign in now and continue your journey of knowledge with consistency and clarity.
ar: سجل الدخول لحفظ محادثاتك، وإعادة زيارة أسئلتك السابقة، ومشاركة النقاشات الهادفة مع الآخرين. إنشاء حساب يساعدنا أيضاً على تحسين تجربة التعلم الخاصة بك — من خلال تخصيص الرؤى وتفضيلات اللغة ومسارات المراجع لك. سجل الدخول الآن وواصل رحلتك في طلب العلم بثبات ووضوح.
ur: اپنی گفتگوئیں محفوظ کرنے، سابقہ سوالات دوبارہ دیکھنے، اور بامعنی مباحث شیئر کرنے کے لیے لاگ اِن کریں۔ اکاؤنٹ بنانے سے ہم آپ کے سیکھنے کے تجربے کو بہتر بنا سکتے ہیں—بصیرت، زبان کی ترجیحات، اور حوالہ جاتی راستوں کو آپ کے لیے ذاتی بنا کر۔ ابھی سائن اِن کریں اور علم کی اس راہ پر مستقل مزاجی اور وضاحت کے ساتھ چلتے رہیں۔

# welcome.getStarted
source: Get Started
ar: ابدأ الآن
ur: شروع کریں

# welcome.skipToChat
source: Skip to Chat
ar: الانتقال للمحادثة
ur: گفتگو پر جائیں

# startup.restoringTitle
source: Restoring your session
ar: جارٍ استعادة جلستك
ur: آپ کی نشست بحال کی جا رہی ہے

# startup.restoringMessage
source: Preparing your workspace securely...
ar: نُعِد مساحتك بشكل آمن...
ur: آپ کی ورک اسپیس محفوظ انداز میں تیار کی جا رہی ہے...

# startup.quote1
source: "And say, My Lord, increase me in knowledge." (Qur'an 20:114)
ar: "وَقُل رَّبِّ زِدْنِي عِلْمًا" (طه: 114)
ur: "اور کہو: اے میرے رب! میرے علم میں اضافہ فرما۔" (سورۃ طہٰ: 114)

# startup.quote2
source: "Whoever travels a path seeking knowledge, Allah eases a path to Paradise for them."
ar: "من سلك طريقًا يلتمس فيه علمًا سهّل الله له به طريقًا إلى الجنة."
ur: "جو شخص علم کی تلاش میں کسی راستے پر چلتا ہے، اللہ اس کے لیے جنت کا راستہ آسان فرما دیتا ہے۔"

# startup.quote3
source: Patience is a light. We are reconnecting you to your saved journey.
ar: الصبر نور. جارٍ إعادة ربطك برحلتك المحفوظة.
ur: صبر روشنی ہے۔ آپ کی محفوظ علمی سفر سے دوبارہ ربط قائم کیا جا رہا ہے۔

# empty.description
source: Ask any question about Islam or use the camera to fact-check text. All answers are based on authentic Islamic sources from the Shamela library.
ar: اسأل أي سؤال عن الإسلام أو استخدم الكاميرا للتحقق من صحة النص. جميع الإجابات مستندة إلى المصادر الإسلامية الموثوقة من مكتبة الشاملة.
ur: اسلام کے بارے میں کوئی بھی سوال کریں یا متن کی تصدیق کے لیے کیمرہ استعمال کریں۔ تمام جوابات شامیلا لائبریری کے مستند اسلامی ذرائع پر مبنی ہیں۔

# empty.tryAsking
source: Try asking:
ar: جرب السؤال:
ur: یہ پوچھ کر دیکھیں:

# empty.suggestion1
source: What are the pillars of Islam?
ar: ما هي أركان الإسلام؟
ur: اسلام کے ارکان کیا ہیں؟

# empty.suggestion2
source: Tell me about the importance of prayer
ar: أخبرني عن أهمية الصلاة
ur: نماز کی اہمیت کے بارے میں بتائیں

# empty.suggestion3
source: What does Islam say about charity?
ar: ماذا يقول الإسلام عن الصدقة؟
ur: صدقہ کے بارے میں اسلام کیا کہتا ہے؟

# error.title
source: Error
ar: خطأ
ur: خرابی

# error.noInternetConnection
source: No internet connection
ar: لا يوجد اتصال بالإنترنت
ur: انٹرنیٹ کنکشن نہیں ہے

# error.unableToConnect
source: Unable to connect
ar: غير قادر على الاتصال
ur: رابطہ ممکن نہیں

# error.permissionRequired
source: Permission required
ar: الإذن مطلوب
ur: اجازت درکار ہے

# error.somethingWentWrong
source: Something went wrong
ar: حدث خطأ ما
ur: کچھ غلط ہو گیا

# error.codeFormat
source: Error code: %@
ar: رمز الخطأ: %@
ur: خرابی کا کوڈ: %@

# error.supportSuffix
source: If this seems unexpected, please shake your device or go to Settings to report to our support team.
ar: إذا بدا هذا غير متوقع، يرجى هز جهازك أو الذهاب إلى الإعدادات للإبلاغ لفريق الدعم الخاص بنا.
ur: اگر یہ غیر متوقع لگتا ہے، تو اپنے ڈیوائس کو ہلائیں یا ہماری سپورٹ ٹیم کو رپورٹ کرنے کے لیے سیٹنگز پر جائیں۔

# error.retry
source: Retry
ar: إعادة المحاولة
ur: دوبارہ کوشش کریں

# error.openSettings
source: Open Settings
ar: فتح الإعدادات
ur: سیٹنگز کھولیں

# error.tryAgain
source: Try Again
ar: حاول مرة أخرى
ur: دوبارہ کوشش کریں

# common.ok
source: OK
ar: موافق
ur: ٹھیک ہے

# common.save
source: Save
ar: حفظ
ur: محفوظ کریں

# network.invalidURL
source: Unable to connect to the server. Please try again later.
ar: تعذر الاتصال بالخادم. يرجى المحاولة مرة أخرى لاحقاً.
ur: سرور سے جڑنے میں مسئلہ۔ براہ کرم بعد میں کوشش کریں۔

# network.invalidResponse
source: Unable to connect to the server. Please try again later.
ar: تعذر الاتصال بالخادم. يرجى المحاولة مرة أخرى لاحقاً.
ur: سرور سے جڑنے میں مسئلہ۔ براہ کرم بعد میں کوشش کریں۔

# network.noConnection
source: No internet connection. Please check your network settings.
ar: لا يوجد اتصال بالإنترنت. يرجى التحقق من إعدادات الشبكة.
ur: انٹرنیٹ کنکشن نہیں۔ براہ کرم نیٹ ورک سیٹنگز چیک کریں۔

# network.timeout
source: Request timed out. Please check your connection and try again.
ar: انتهت مهلة الطلب. يرجى التحقق من اتصالك والمحاولة مرة أخرى.
ur: درخواست کا وقت ختم ہو گیا۔ کنکشن چیک کریں اور دوبارہ کوشش کریں۔

# network.unknownError
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.
ur: غیر متوقع خرابی پیش آئی۔ دوبارہ کوشش کریں۔

# network.invalidRequest
source: Invalid request. Please check your input.
ar: طلب غير صالح. يرجى التحقق من إدخالك.
ur: غلط درخواست۔ براہ کرم اپنے اندراج کی جانچ کریں۔

# network.authRequired
source: Authentication required. Please sign in.
ar: المصادقة مطلوبة. يرجى تسجيل الدخول.
ur: توثیق درکار ہے۔ براہ کرم سائن اِن کریں۔

# network.accessForbidden
source: Access forbidden.
ar: الوصول محظور.
ur: رسائی ممنوع ہے۔

# network.resourceNotFound
source: Resource not found.
ar: المورد غير موجود.
ur: وسیلہ نہیں ملا۔

# network.tooManyRequests
source: Too many requests. Please try again later.
ar: طلبات كثيرة جداً. يرجى المحاولة مرة أخرى لاحقاً.
ur: درخواستیں بہت زیادہ ہیں۔ بعد میں کوشش کریں۔

# network.serverError
source: Server error. Please try again later.
ar: خطأ في الخادم. يرجى المحاولة مرة أخرى لاحقاً.
ur: سرور میں خرابی ہے۔ براہ کرم بعد میں کوشش کریں۔

# network.genericError
source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
ur: کوئی خرابی پیش آئی۔ دوبارہ کوشش کریں۔

# network.decodingError
source: Unable to process server response. Please try again.
ar: تعذر معالجة استجابة الخادم. يرجى المحاولة مرة أخرى.
ur: سرور کا جواب پڑھا نہیں جا سکا۔ براہ کرم دوبارہ کوشش کریں۔

# network.checkConnection
source: Please check your connection and try again
ar: يرجى التحقق من اتصالك والمحاولة مرة أخرى
ur: براہ کرم اپنا کنکشن چیک کریں اور دوبارہ کوشش کریں

# network.unexpectedError
source: An unexpected error occurred. Please try again.
ar: حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.
ur: غیر متوقع خرابی پیش آئی۔ براہ کرم دوبارہ کوشش کریں۔

# ocr.invalidImage
source: Unsupported or blurry image. Please try a clearer photo.
ar: الصورة غير مدعومة أو غير واضحة. يرجى المحاولة بصورة أوضح.
ur: غیر معاون یا دھندلی تصویر۔ براہ کرم واضح تصویر دوبارہ آزمائیں۔

# ocr.noTextFound
source: No text found in image.
ar: لم يتم العثور على نص في الصورة.
ur: تصویر میں کوئی متن نہیں ملا۔

# ocr.recognitionFailed
source: Text recognition failed. Please try again.
ar: فشل التعرف على النص. يرجى المحاولة مرة أخرى.
ur: متن شناخت نہیں ہو سکی۔ براہ کرم دوبارہ کوشش کریں۔

# ocr.imageDataMissing
source: Image data is missing. Please select the image again.
ar: بيانات الصورة مفقودة. يرجى اختيار الصورة مرة أخرى.
ur: تصویری ڈیٹا دستیاب نہیں۔ براہ کرم تصویر دوبارہ منتخب کریں۔

# ocr.sendForFactCheck
source: Send for Fact Check
ar: إرسال للتحقق من الحقائق
ur: حقائق کی جانچ کے لیے بھیجیں

# history.factCheckBadge
source: Fact-check
ar: تحقق من الحقائق
ur: فیکٹ چیک

# about.content
source: ShamelaGPT is an AI-powered Islamic knowledge assistant built upon the vast and trusted library of Shamela.ws. Our mission is to make reliable, reference-based Islamic knowledge accessible to everyone in a natural and conversational way. We combine cutting-edge AI technology with authentic Islamic sources to provide accurate answers, backed by proper references from classical and contemporary Islamic scholarship.
ar: شاملة جي بي تي هو مساعد معرفي إسلامي مدعوم بالذكاء الاصطناعي تم بناؤه على المكتبة الشاملة الموثوقة من موقع Shamela.ws. مهمتنا هي جعل المعرفة الإسلامية الموثوقة والمستندة إلى المراجع متاحة للجميع بطريقة طبيعية وحوارية. نحن نجمع بين تقنية الذكاء الاصطناعي المتطورة والمصادر الإسلامية الموثوقة لتقديم إجابات دقيقة، مدعومة بالمراجع الصحيحة من العلماء الإسلاميين الكلاسيكيين والمعاصرين.
ur: شاملہ جی پی ٹی ایک AI سے مدد یافتہ اسلامی علمی معاون ہے جو معتبر Shamela.ws لائبریری پر مبنی ہے۔ ہمارا مقصد مستند اور حوالہ شدہ اسلامی علم کو ہر کسی کے لیے قدرتی اور مکالماتی انداز میں دستیاب کرنا ہے۔ ہم جدید AI ٹیکنالوجی کو مستند اسلامی ذرائع کے ساتھ ملاتے ہیں تاکہ درست جوابات فراہم کریں جو کلاسیکی اور معاصر علمی حوالوں سے مضبوط ہوں۔

# about.missionTitle
source: Our Mission
ar: مهمتنا
ur: ہمارا مشن

# about.mission
source: To provide reliable, AI-powered access to authentic Islamic knowledge for research, education, and fact-checking—without replacing scholarship or religious authority.
ar: توفير وصول موثوق مدعوم بالذكاء الاصطناعي إلى المعرفة الإسلامية الأصيلة لأغراض البحث والتعليم والتحقق من المعلومات—دون أن يكون بديلاً عن العلماء أو المرجعيات الشرعية.
ur: تحقیق، تعلیم اور معلومات کی تصدیق کے لیے مستند اسلامی علم تک قابلِ اعتماد، AI سے مدد یافتہ رسائی فراہم کرنا—بغیر اس کے کہ علمائے دین یا شرعی اتھارٹی کی جگہ لے۔

# about.mission.pointSupport
source: Support students, researchers, educators, and developers
ar: دعم طلبة العلم والباحثين والمربين والمطورين
ur: طلبہ، محققین، اساتذہ اور ڈویلپرز کی مدد کرنا

# about.mission.pointCombatMisinformation
source: Combat misinformation and misrepresentation of Islam online
ar: مكافحة التضليل وتشويه صورة الإسلام على الإنترنت
ur: آن لائن اسلام کی غلط تصویر اور گمراہ کن معلومات کا مقابلہ کرنا

# about.mission.pointEthicalAI
source: Enable ethical AI use in Islamic knowledge systems
ar: تمكين الاستخدام الأخلاقي للذكاء الاصطناعي في أنظمة المعرفة الإسلامية
ur: اسلامی علمی نظاموں میں اخلاقی AI کے استعمال کو ممکن بنانا

# about.mission.pointPreserveTrust
source: Preserve trust by prioritizing sources, citations, and context
ar: تعزيز الثقة عبر التركيز على المصادر والإحالات والسياق
ur: ماخذ، حوالہ اور سیاق کو ترجیح دے کر اعتماد قائم رکھنا

# about.visionTitle
source: Our Vision
ar: رؤيتنا
ur: ہماری وژن

# about.visionIntro
source: We envision a future where:
ar: نتطلع إلى مستقبل يكون فيه:
ur: ہم ایسے مستقبل کا تصور کرتے ہیں جہاں:

# about.vision.pointSources
source: Authentic Islamic sources are the foundation of AI-driven knowledge tools
ar: المصدر الإسلامي الأصيل هو أساس أدوات المعرفة المعتمدة على الذكاء الاصطناعي
ur: مستند اسلامی مصادر AI پر مبنی علمی ٹولز کی بنیاد ہوں

# about.vision.pointVerifiable
source: Islamic information online is verifiable, contextual, and responsibly delivered
ar: المعلومات الإسلامية على الإنترنت قابلة للتحقق، موثقة، وواعية بالسياق
ur: آن لائن اسلامی معلومات قابلِ تصدیق، باحوالہ اور ذمہ دارانہ انداز میں پیش کی جائیں

# about.vision.pointUnderrepresented
source: Underrepresented languages and communities gain equal access to trusted knowledge
ar: للمجتمعات واللغات الأقل تمثيلاً وصول أفضل إلى معرفة موثوقة
ur: کم نمائندگی رکھنے والی زبانوں اور برادریوں کو مستند علم تک مساوی رسائی ملے

# about.vision.pointChildren
source: Children and new reverts receive age-appropriate, compassionate explanations
ar: للأطفال والمهتدين الجدد شروحات مبسطة ومراعية للسن والاحتياج
ur: بچوں اور نئے مسلم ہونے والوں کو عمر کے مطابق اور نرم لہجے میں وضاحتیں ملیں

# about.vision.pointDevelopers
source: Developers and institutions can build on open, auditable knowledge infrastructure
ar: للمطورين والمؤسسات بنية تحتية معرفية قابلة للتدقيق والبناء المسؤول
ur: ڈویلپرز اور ادارے کھلے، قابلِ جانچ علمی انفراسٹرکچر پر اعتماد سے تعمیر کر سکیں

# about.goalTitle
source: Our Goal
ar: هدفنا
ur: ہمارا ہدف
